results/consumer-slice/consumer-security-slice-tls-broker5/consumer-security-slice-tls-b5-rf3-isr3-msg1024-tps1000-batch16384-acksall-prod1-cons1-compnone-trial1/producer-seed.log
4987 records sent, 995.2 records/sec (0.97 MB/sec), 83.1 ms avg latency, 1144.0 ms max latency.
5024 records sent, 1004.4 records/sec (0.98 MB/sec), 5.5 ms avg latency, 29.0 ms max latency.
5001 records sent, 1000.0 records/sec (0.98 MB/sec), 5.2 ms avg latency, 14.0 ms max latency.
5004 records sent, 1000.4 records/sec (0.98 MB/sec), 5.1 ms avg latency, 10.0 ms max latency.
5006 records sent, 1000.2 records/sec (0.98 MB/sec), 5.1 ms avg latency, 23.0 ms max latency.
5006 records sent, 1000.2 records/sec (0.98 MB/sec), 5.0 ms avg latency, 10.0 ms max latency.
5003 records sent, 1000.0 records/sec (0.98 MB/sec), 5.1 ms avg latency, 10.0 ms max latency.
5002 records sent, 1000.0 records/sec (0.98 MB/sec), 5.0 ms avg latency, 11.0 ms max latency.
5006 records sent, 1000.0 records/sec (0.98 MB/sec), 4.9 ms avg latency, 11.0 ms max latency.
5005 records sent, 1000.2 records/sec (0.98 MB/sec), 5.1 ms avg latency, 27.0 ms max latency.
5005 records sent, 1000.2 records/sec (0.98 MB/sec), 5.0 ms avg latency, 14.0 ms max latency.
5005 records sent, 1000.4 records/sec (0.98 MB/sec), 5.0 ms avg latency, 10.0 ms max latency.
5002 records sent, 1000.2 records/sec (0.98 MB/sec), 5.0 ms avg latency, 12.0 ms max latency.
5007 records sent, 1000.2 records/sec (0.98 MB/sec), 5.0 ms avg latency, 25.0 ms max latency.
5006 records sent, 1000.4 records/sec (0.98 MB/sec), 4.9 ms avg latency, 11.0 ms max latency.
5005 records sent, 1000.2 records/sec (0.98 MB/sec), 5.0 ms avg latency, 14.0 ms max latency.
5005 records sent, 1000.0 records/sec (0.98 MB/sec), 5.0 ms avg latency, 13.0 ms max latency.
5005 records sent, 1000.2 records/sec (0.98 MB/sec), 5.0 ms avg latency, 27.0 ms max latency.
5003 records sent, 1000.2 records/sec (0.98 MB/sec), 5.0 ms avg latency, 11.0 ms max latency.
100000 records sent, 999.740068 records/sec (0.98 MB/sec), 8.94 ms avg latency, 1144.00 ms max latency, 5 ms 50th, 8 ms 95th, 273 ms 99th, 379 ms 99.9th.